[
  "YANA gave my parents an apartment to live in near the hospital. Mom and Dad told me that YANA was able to help us because we lived in the Comox Valley, where people cared alot.",
  "When our newborn son was flown from St Joe’s to Nanaimo and then to Victoria, your organization was right there with instant financial aid; no red tape, no questions asked.",
  "To say thanks seems rather inadequate after all you did for our family. Greater even than the money, was having someone on our side making arrangements with hotels etc. so we could focus on taking care of our boy.",
  "In the hospital we were given an envelope that had $100 in it for any expenses we would have in Vancouver – a gift that was very unexpected and so appreciated provided by your wonderful organization.",
  "I don’t know what we would do without you guys. You are always there when we need it. I am so happy Owen has an amazing community supporting him.",
  "Thank you so much for your help during a scary and difficult time for us. Your generousity allowed us to put all of our energy into our beautiful girl.",
  "It is hard to explain how much it means to have stress from other areas removed while going through such a lengthy and emotionally draining hospital stay.",
  "It was such a blessing to have the YANA apartment for a refuge away from the hospital, a place to grieve in private, rest, and be together as a family.",
  "YANA gave me the ability to concentrate 100% on my son. I didn’t have to worry about anything but just being healthy and keeping my son healthy. YANA was a really integral part of our life.",
  "We got into contact with YANA and they made arrangements to put us up at the apartment for when he had his open heart surgery at Children’s Hospital, which was amazing.",
  "Thank you again for all your help. Without your services, who knows where we would be.",
  "Thank you so much for all of your support during our daughter’s recent hospitalization. Your caring and understanding was greatly appreciated.",
  "Thank you so much for your support at a very difficult and stressful time. Our son is doing really well and we appreciate that you made a hard time easier for us all."
]
